org/20220517173422-free_trade.org
:PROPERTIES:
:ID:       0b6ccd45-86da-4f9d-bda6-f7ae058ec2a0
:END:
#+TITLE: Free Trade
#+CREATED: [2022-05-17 Tue 17:34]
#+LAST_MODIFIED: [2022-05-17 Tue 17:39]

* Against the free movement of capital

We can be in favor of Free-Trade yet oppose the free movement of capital. Either for economic reasons; the comparative advantages disappear when capital is allowed to move freely (it will move the means of production to where it is cheaper), and inflows of capital can destabilize economies.


* References

- David Ricardo. The Principles of Political Economy and Taxation.
- Jagdish Bhagwati. [[https://www.jstor.org/stable/20048871][The Capital Myth: The Difference between Trade in Widgets and Trade in Dollars]].
- Michael Howell. Capital Wars.
