20220517173422-free_trade.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-21 Wed 19:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Free Trade</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Free Trade</h1>

<div id="outline-container-orga3b9f49" class="outline-2">
<h2 id="orga3b9f49">Against the free movement of capital</h2>
<div class="outline-text-2" id="text-orga3b9f49">
<p>
We can be in favor of Free-Trade yet oppose the free movement of capital. Either for economic reasons; the comparative advantages disappear when capital is allowed to move freely (it will move the means of production to where it is cheaper), and inflows of capital can destabilize economies.
</p>
</div>
</div>


<div id="outline-container-orgc697086" class="outline-2">
<h2 id="orgc697086">References</h2>
<div class="outline-text-2" id="text-orgc697086">
<ul class="org-ul">
<li>David Ricardo. The Principles of Political Economy and Taxation.</li>
<li>Jagdish Bhagwati. <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.jstor.org/stable/20048871">The Capital Myth: The Difference between Trade in Widgets and Trade in Dollars</a>.</li>
<li>Michael Howell. Capital Wars.</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf54866" class="outline-2">
<h2 id="orgaf54866">Links to this note</h2>
</div>
</div>
</body>
</html>